In [1]:
import pandas as pd
import numpy as np

In [2]:
file_path = '../Data/BestPlayers.csv'

In [3]:
df = pd.read_csv(file_path, sep=';', encoding='utf-8')
print(df.shape)
df.head()

(344953, 8)

,Date,WhiteName,WhiteElo,BlackName,BlackElo,Result,ECO,Decade
0,2000.03.??,"Kasparov, Garry",2851.0,"Stoffers, Jeffrey",NaN,1-0,D35,200
1,2000.03.??,"Kasparov, Garry",2851.0,"Tomasso, Santiago",NaN,1-0,B01,200
2,1999.11.20,"Kasparov, Garry",2851.0,"Teixeira, Rafael Goltsman",NaN,1-0,C54,199
3,1999.11.20,"Kasparov, Garry",2851.0,"Quintino, Luis Felipe Pires",NaN,1-0,B01,199
4,2000.02.09,"Kasparov, Garry",2851.0,"Piket, Jeroen",2633.0,1/2-1/2,C99,200

In [4]:
df['Date'] = df['Date'].map(lambda x: int(x[:4]))

In [5]:
df = df.drop(columns=['WhiteName','WhiteElo','BlackName','BlackElo','Decade'])

In [6]:
df.head()

   Date   Result  ECO
0  2000      1-0  D35
1  2000      1-0  B01
2  1999      1-0  C54
3  1999      1-0  B01
4  2000  1/2-1/2  C99

Need a dataframe which has columns: ECO, Year, Games, White, Draw, Black
where the primary key is (ECO, Year) and the Games, White, Draw, and Black correspond to that key.

Games - Total number of games for that (ECO, Year) pair
White - Total number of white wins
Draw - Total number of draws
Black - Total number of black wins
(if "1-0" -> white, else if "1/2-1/2" -> draw, else -> black)